ARMmbed/mbed-os/targets/TARGET_STM/TARGET_STM32U5/STM32Cube_FW/STM32U5xx_HAL_Driver/stm32u5xx_hal_dsi.h
/** @defgroup DSI_Color_Coding DSI Color Coding
  * @{
  */
#define DSI_RGB565                 0x00000000U /*!< The values 0x00000001 and 0x00000002 can also be used for the RGB565 color mode configuration */
#define DSI_RGB666                 0x00000003U /*!< The value 0x00000004 can also be used for the RGB666 color mode configuration                 */
#define DSI_RGB888                 0x00000005U
/**
  * @}
  */

/** @defgroup DSI_LooselyPacked DSI Loosely Packed
  * @{
  */
#define DSI_LOOSELY_PACKED_ENABLE  DSI_LCOLCR_LPE
#define DSI_LOOSELY_PACKED_DISABLE 0x00000000U
/**
  * @}
  */

/** @defgroup DSI_HSYNC_Polarity DSI HSYNC Polarity
  * @{
  */
#define DSI_HSYNC_ACTIVE_HIGH       0x00000000U
#define DSI_HSYNC_ACTIVE_LOW        DSI_LPCR_HSP
/**
  * @}
  */

/** @defgroup DSI_VSYNC_Active_Polarity DSI VSYNC Active Polarity
  * @{
  */
#define DSI_VSYNC_ACTIVE_HIGH       0x00000000U
#define DSI_VSYNC_ACTIVE_LOW        DSI_LPCR_VSP
/**
  * @}
  */

/** @defgroup DSI_DATA_ENABLE_Polarity DSI DATA ENABLE Polarity
  * @{
  */
#define DSI_DATA_ENABLE_ACTIVE_HIGH 0x00000000U
#define DSI_DATA_ENABLE_ACTIVE_LOW  DSI_LPCR_DEP
/**
  * @}
  */

/** @defgroup DSI_PLL_IDF DSI PLL IDF
  * @{
  */
#define DSI_PLL_IN_DIV1             0x00000001U
#define DSI_PLL_IN_DIV2             0x00000002U
#define DSI_PLL_IN_DIV3             0x00000003U
#define DSI_PLL_IN_DIV4             0x00000004U
#define DSI_PLL_IN_DIV5             0x00000005U
#define DSI_PLL_IN_DIV6             0x00000006U
#define DSI_PLL_IN_DIV7             0x00000007U
/**
  * @}
  */

/** @defgroup DSI_PLL_ODF DSI PLL ODF
  * @{
  */
#define DSI_PLL_OUT_DIV1            0x00000001U
#define DSI_PLL_OUT_DIV2            0x00000002U
#define DSI_PLL_OUT_DIV3            0x00000003U
#define DSI_PLL_OUT_DIV4            0x00000004U
#define DSI_PLL_OUT_DIV5            0x00000005U
#define DSI_PLL_OUT_DIV6            0x00000006U
#define DSI_PLL_OUT_DIV7            0x00000007U
#define DSI_PLL_OUT_DIV8            0x00000008U
#define DSI_PLL_OUT_DIV9            0x00000009U
/**
  * @}
  */

/** @defgroup DSI_Flags DSI Flags
  * @{
  */
#define DSI_FLAG_TE                 DSI_WISR_TEIF
#define DSI_FLAG_ER                 DSI_WISR_ERIF
#define DSI_FLAG_BUSY               DSI_WISR_BUSY
#define DSI_FLAG_PLLLS              DSI_WISR_PLLLS
#define DSI_FLAG_PLLL               DSI_WISR_PLLLIF
#define DSI_FLAG_PLLU               DSI_WISR_PLLUIF
/**
  * @}
  */

/** @defgroup DSI_Interrupts DSI Interrupts
  * @{
  */
#define DSI_IT_TE                   DSI_WIER_TEIE
#define DSI_IT_ER                   DSI_WIER_ERIE
#define DSI_IT_PLLL                 DSI_WIER_PLLLIE
#define DSI_IT_PLLU                 DSI_WIER_PLLUIE
/**
  * @}
  */

/** @defgroup DSI_SHORT_WRITE_PKT_Data_Type DSI SHORT WRITE PKT Data Type
  * @{
  */
#define DSI_DCS_SHORT_PKT_WRITE_P0  0x00000005U /*!< DCS short write, no parameters      */
#define DSI_DCS_SHORT_PKT_WRITE_P1  0x00000015U /*!< DCS short write, one parameter      */
#define DSI_GEN_SHORT_PKT_WRITE_P0  0x00000003U /*!< Generic short write, no parameters  */
#define DSI_GEN_SHORT_PKT_WRITE_P1  0x00000013U /*!< Generic short write, one parameter  */
#define DSI_GEN_SHORT_PKT_WRITE_P2  0x00000023U /*!< Generic short write, two parameters */
/**
  * @}
  */

/** @defgroup DSI_LONG_WRITE_PKT_Data_Type DSI LONG WRITE PKT Data Type
  * @{
  */
#define DSI_DCS_LONG_PKT_WRITE      0x00000039U /*!< DCS long write     */
#define DSI_GEN_LONG_PKT_WRITE      0x00000029U /*!< Generic long write */
/**
  * @}
  */

/** @defgroup DSI_SHORT_READ_PKT_Data_Type DSI SHORT READ PKT Data Type
  * @{
  */
#define DSI_DCS_SHORT_PKT_READ      0x00000006U /*!< DCS short read                     */
#define DSI_GEN_SHORT_PKT_READ_P0   0x00000004U /*!< Generic short read, no parameters  */
#define DSI_GEN_SHORT_PKT_READ_P1   0x00000014U /*!< Generic short read, one parameter  */
#define DSI_GEN_SHORT_PKT_READ_P2   0x00000024U /*!< Generic short read, two parameters */
/**
  * @}
  */

/** @defgroup DSI_Error_Data_Type DSI Error Data Type
  * @{
  */
#define HAL_DSI_ERROR_NONE              0U
#define HAL_DSI_ERROR_ACK               0x00000001U /*!< Acknowledge errors             */
#define HAL_DSI_ERROR_PHY               0x00000002U /*!< PHY related errors             */
#define HAL_DSI_ERROR_TX                0x00000004U /*!< Transmission error             */
#define HAL_DSI_ERROR_RX                0x00000008U /*!< Reception error                */
#define HAL_DSI_ERROR_ECC               0x00000010U /*!< ECC errors                     */
#define HAL_DSI_ERROR_CRC               0x00000020U /*!< CRC error                      */
#define HAL_DSI_ERROR_PSE               0x00000040U /*!< Packet Size error              */
#define HAL_DSI_ERROR_EOT               0x00000080U /*!< End Of Transmission error      */
#define HAL_DSI_ERROR_OVF               0x00000100U /*!< FIFO overflow error            */
#define HAL_DSI_ERROR_GEN               0x00000200U /*!< Generic FIFO related errors    */
#define HAL_DSI_ERROR_PBU               0x00000400U /*!< Payload Buffer Underflow error */
#if (USE_HAL_DSI_REGISTER_CALLBACKS == 1)
#define HAL_DSI_ERROR_INVALID_CALLBACK  0x00000800U /*!< DSI Invalid Callback error      */
#endif /* USE_HAL_DSI_REGISTER_CALLBACKS */
/**
  * @}
  */

/** @defgroup DSI_Lane_Group DSI Lane Group
  * @{
  */
#define DSI_CLOCK_LANE              0x00000000U
#define DSI_DATA_LANES              0x00000001U
/**
  * @}
  */


/** @defgroup DSI_CustomLane DSI CustomLane
  * @{
  */
#define DSI_SWAP_LANE_PINS          0x00000000U
/**
  * @}
  */

/** @defgroup DSI_Lane_Select DSI Lane Select
  * @{
  */
#define DSI_CLK_LANE                0x00000000U
#define DSI_DATA_LANE0              0x00000001U
#define DSI_DATA_LANE1              0x00000002U
/**
  * @}
  */


/** @defgroup DSI_DPHY_VCO_Frequency_RANGE   DSI DPHY VCO Frequency Range
  * @{
  */
#define DSI_DPHY_VCO_FRANGE_500MHZ_800MHZ           0x00000000U    /*!< 500-800 MHz  */
#define DSI_DPHY_VCO_FRANGE_800MHZ_1GHZ             0x00000001U    /*!< 800-1000 MHz */
/**
  * @}
  */


/** @defgroup DSI_PHYFrequencyRange DSI DPHY Frequency Range
  * @{
  */
#define DSI_DPHY_FRANGE_80MHZ_100MHZ      0x00000000U     /*!< 80-100  MHz */
#define DSI_DPHY_FRANGE_100MHZ_120MHZ     0x00000001U     /*!< 100-120 MHz */
#define DSI_DPHY_FRANGE_120MHZ_160MHZ     0x00000002U     /*!< 120-160 MHz */
#define DSI_DPHY_FRANGE_160MHZ_200MHZ     0x00000003U     /*!< 160-200 MHz */
#define DSI_DPHY_FRANGE_200MHZ_240MHZ     0x00000004U     /*!< 200-240 MHz */
#define DSI_DPHY_FRANGE_240MHZ_320MHZ     0x00000005U     /*!< 240-320 MHz */
#define DSI_DPHY_FRANGE_320MHZ_390MHZ     0x00000006U     /*!< 320-390 MHz */
#define DSI_DPHY_FRANGE_390MHZ_450MHZ     0x00000007U     /*!< 390-450 MHz */
#define DSI_DPHY_FRANGE_450MHZ_510MHZ     0x00000008U     /*!< 450-510 MHz */

/**
  * @}
  */

/** @defgroup DSI_DPHY_Slew_Rate DSI D-PHY Slew rate
  * @{
  */
#define DSI_DPHY_SLEW_HS_TX_SPEED        0x0000000EU       /*!< 80-750Mbits/s */
/**
  * @}
  */

/** @defgroup DSI_HS_PREPARE_Offset DSI HS Prepare Offset
  * @{
  */
#define DSI_HS_PREPARE_OFFSET0   0x00000000U    /*!< 100-120 & 120-160 & 240-320 MHz          */
#define DSI_HS_PREPARE_OFFSET1   0x00000001U    /*!< 80-100 & 160-200 & 200-240 & 320-390 MHz */
#define DSI_HS_PREPARE_OFFSET2   0x00000002U    /*!< 390-450 & 450-510 MHz                    */
/**
  * @}
  */

/** @defgroup DSI_PHYLowPowerOffset  DSI PHY Low Power Offset
  * @{
  */
#define PHY_LP_OFFSSET_0_CLKP        0x00000000U
#define PHY_LP_OFFSSET_1_CLKP        0x00000001U
#define PHY_LP_OFFSSET_2_CLKP        0x00000002U
#define PHY_LP_OFFSSET_3_CLKP        0x00000003U
#define PHY_LP_OFFSSET_4_CLKP        0x00000004U
#define PHY_LP_OFFSSET_5_CLKP        0x00000005U
#define PHY_LP_OFFSSET_6_CLKP        0x00000006U
#define PHY_LP_OFFSSET_7_CLKP        0x00000007U
#define PHY_LP_OFFSSET_MINUS_1_CLKP  0x00000008U
#define PHY_LP_OFFSSET_MINUS_2_CLKP  0x00000009U
#define PHY_LP_OFFSSET_MINUS_3_CLKP  0x0000000AU
#define PHY_LP_OFFSSET_MINUS_4_CLKP  0x0000000BU
#define PHY_LP_OFFSSET_MINUS_5_CLKP  0x0000000CU
#define PHY_LP_OFFSSET_MINUS_6_CLKP  0x0000000DU
#define PHY_LP_OFFSSET_MINUS_7_CLKP  0x0000000EU
#define PHY_LP_OFFSSET_MINUS_8_CLKP  0x0000000FU
/**
  * @}
  */


/** @defgroup DSI_PLL_Tuning DSI PLL Tuning
  * @{
  */
#define DSI_PLL_LOOP_FILTER_2000HZ_4400HZ      0x00000000U    /*!< 2.0 to 4.4 MHz  */
#define DSI_PLL_LOOP_FILTER_4400HZ_30900HZ     0x00000001U    /*!< 4.4 to 30.9 MHz */
#define DSI_PLL_LOOP_FILTER_30900HZ_50000HZ    0x00000002U    /*!< 30.9 to 50  MHz */

/**
  * @}
  */

