ARMmbed/mbed-os/targets/TARGET_STM/TARGET_STM32U5/STM32Cube_FW/STM32U5xx_HAL_Driver/stm32u5xx_hal_dsi.h
#define IS_DSI_DPHY_BAND_CTL_FRANGE(PHYFrequencyRange) (((PHYFrequencyRange) == DSI_DPHY_FRANGE_80MHZ_100MHZ)  ||\
                                                        ((PHYFrequencyRange) == DSI_DPHY_FRANGE_100MHZ_120MHZ) ||\
                                                        ((PHYFrequencyRange) == DSI_DPHY_FRANGE_120MHZ_160MHZ) ||\
                                                        ((PHYFrequencyRange) == DSI_DPHY_FRANGE_160MHZ_200MHZ) ||\
                                                        ((PHYFrequencyRange) == DSI_DPHY_FRANGE_200MHZ_240MHZ) ||\
                                                        ((PHYFrequencyRange) == DSI_DPHY_FRANGE_240MHZ_320MHZ) ||\
                                                        ((PHYFrequencyRange) == DSI_DPHY_FRANGE_320MHZ_390MHZ) ||\
                                                        ((PHYFrequencyRange) == DSI_DPHY_FRANGE_390MHZ_450MHZ) ||\
                                                        ((PHYFrequencyRange) == DSI_DPHY_FRANGE_450MHZ_510MHZ))
#define IS_DSI_DPHY_LOW_POWER_OFFSET(PHYLowPowerOffset)(((PHYLowPowerOffset) == PHY_LP_OFFSSET_0_CLKP)        ||\
                                                        ((PHYLowPowerOffset) == PHY_LP_OFFSSET_1_CLKP)        ||\
                                                        ((PHYLowPowerOffset) == PHY_LP_OFFSSET_2_CLKP)        ||\
                                                        ((PHYLowPowerOffset) == PHY_LP_OFFSSET_3_CLKP)        ||\
                                                        ((PHYLowPowerOffset) == PHY_LP_OFFSSET_4_CLKP)        ||\
                                                        ((PHYLowPowerOffset) == PHY_LP_OFFSSET_5_CLKP)        ||\
                                                        ((PHYLowPowerOffset) == PHY_LP_OFFSSET_6_CLKP)        ||\
                                                        ((PHYLowPowerOffset) == PHY_LP_OFFSSET_7_CLKP)        ||\
                                                        ((PHYLowPowerOffset) == PHY_LP_OFFSSET_MINUS_1_CLKP)  ||\
                                                        ((PHYLowPowerOffset) == PHY_LP_OFFSSET_MINUS_2_CLKP)  ||\
                                                        ((PHYLowPowerOffset) == PHY_LP_OFFSSET_MINUS_3_CLKP)  ||\
                                                        ((PHYLowPowerOffset) == PHY_LP_OFFSSET_MINUS_4_CLKP)  ||\
                                                        ((PHYLowPowerOffset) == PHY_LP_OFFSSET_MINUS_5_CLKP)  ||\
                                                        ((PHYLowPowerOffset) == PHY_LP_OFFSSET_MINUS_6_CLKP)  ||\
                                                        ((PHYLowPowerOffset) == PHY_LP_OFFSSET_MINUS_7_CLKP)  ||\
                                                        ((PHYLowPowerOffset) == PHY_LP_OFFSSET_MINUS_8_CLKP))
#define IS_DSI_PLL_TUNING(PllTuning) (((PllTuning) == DSI_PLL_LOOP_FILTER_2000HZ_4400HZ)  || \
                                      ((PllTuning) == DSI_PLL_LOOP_FILTER_4400HZ_30900HZ) || \
                                      ((PllTuning) == DSI_PLL_LOOP_FILTER_30900HZ_50000HZ))


#define IS_DSI_PLL_CHARGEPUMP(PllChargePump) (((PllChargePump) == DSI_PLL_CHARGE_PUMP_2000HZ_4400HZ)   || \
                                              ((PllChargePump) == DSI_PLL_CHARGE_PUMP_4400HZ_14100HZ)  || \
                                              ((PllChargePump) == DSI_PLL_CHARGE_PUMP_14100HZ_30900HZ) || \
                                              ((PllChargePump) == DSI_PLL_CHARGE_PUMP_30900HZ_45700HZ) || \
                                              ((PllChargePump) == DSI_PLL_CHARGE_PUMP_45700HZ_50000HZ))
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */
#endif /* DSI */

#ifdef __cplusplus
}
#endif

#endif /* STM32U5xx_HAL_DSI_H */
